local ui = {
    new_checkbox = ui.new_checkbox,
    get = ui.get
}

local client = {
    set_event_callback = client.set_event_callback,
    userid_to_entindex = client.userid_to_entindex,
    exec = client.exec,
    log = client.log
}

local entity = {
    get_local_player = entity.get_local_player,
    get_player_name = entity.get_player_name
}

local killsay_enabled = ui.new_checkbox("LUA", "A", "[TT] Enable trashtalk")
local killsayName_enabled = ui.new_checkbox("LUA","A","[TT] With name")
local deathsay_enabled = ui.new_checkbox("LUA", "A", "[TT] Enable DeathTalk")

local killsay_sentences = {
    "♛ＺＥＭＩＲＡＧＥ ＣＲＥＷ♛","Ｄｏ ｎｏｔ ｔｅｓｔ ｍｙ ＡＡ．","ϯвøю ʍαʍαωӄყ øϯъεbαԉ прøςϯøрӈø", "ℙ𝕆𝕊𝕋 𝕋ℍ𝕀𝕊 𝕆ℕ ℙℝ𝕆𝔽𝕀𝕃𝔼𝕊 𝕆ℕ 𝕋ℍ𝔼 ℙ𝔼𝕆ℙ𝕃𝔼 𝕐𝕆𝕌 𝔸ℝ𝔼 ℝ𝕀ℂ𝔼ℍ𝔼ℝ 𝕋ℍ𝔸ℕ, 𝕋𝕆 ℂ𝔸𝕃𝕃 𝕋ℍ𝔼𝕄 ℙ𝕆𝕆ℝ! 𝕀𝔽 𝕐𝕆𝕌 𝔾𝕆𝕋 𝕋ℍ𝕀𝕊 ℂ𝕆𝕄𝕄𝔼ℕ𝕋... 𝕎𝔼𝕃𝕃... 𝕐𝕆𝕌 𝕂ℕ𝕆𝕎 𝕎ℍ𝔸𝕋 𝕀𝕋 𝕄𝔼𝔸ℕ𝕊! ♛ (◣_◢) ♛", "Ｆｏｒｃｅ Ｓａｆｅｐｏｉｎｔ ＝ Ｉｎｓｔａ Ｋｉｌｌ","Wʜᴇɴ I ᴀᴜᴛᴏ ᴡᴀʟʟ, ᴀʟʟ ᴅᴏɢs ᴀʀᴇ sɪʟᴇɴᴛ","Ｏｎｅ ｓｈｏｔ， ｏｎｅ ｋｉｌｌ．","Ｎｏ ｌｕｃｋ， ａｌｌ ｓｋｉｌｌ．","𝟙", "ʜαсτσяɰαя ɓρατɞα - ϶τσ ϱ∂υʜυʯы, κστσρыϱ υсησ᧘ьʒƴюτ ANGELWINGS", "оωиҕки - это докᴀзᴀтᴇльство тоrо, что ты ссᴀныи пидоᴘᴀс", "϶ᴛᴏ angelwings, чᴛᴏ я дᴧя ᴛᴇбя уᴋᴩᴀᴧ", "я подᴀᴘил им всᴇм звᴇздʏ, вᴇдь подᴀᴘил им angelwings", "Обычно, девочки любят сонечку чу, а мальчики — ангелвингс. Но это только до 17 лет. А потом всё становится наоборот.", "Прощать не сложно, сложно заново поверить.", "Запомни братишка одну благодать, тебя ждет не телка, а ангелвингс", "【﻿Ибу тя в подвале】", "кумарнул ♕Ｐ Ｏ Ｄ１Ｋ♕", "не вижу предела / angelwings", "𝕊𝕆ℝℝ𝕐 𝔾𝕌𝕐𝕊 ｡.｡:+*", "MaJIeHkuu_Ho_OnacHekuu",  "ⒶaŴÞ ︻デ 一 PUTIN", 
"♛ｇｈｆｄｂｋｆ ♛", "ＳＯＳＩ ＭＯＹ ＣＨＯＰＰＡ ＣＨＵＰＳ",  "𝒰 𝒢О𝒯 ♡𝒲𝒩𝐸𝒟 𝑀𝒴 ангельские крылья", ":･ﾟ✧𝐅𝐔𝐂𝐊 𝐘𝐎𝐔","✧･ﾟ𝕂𝕐𝕊","♛ 𝕃𝕚𝕟𝕜 𝕞𝕒𝕚𝕟 𝕓𝕖𝕗𝕠𝕣𝕖 𝕤𝕡𝕖𝕒𝕜𝕚𝕟𝕘. ♛",  "♛ 𝕋𝕙𝔼 𝕘𝕃𝕠𝔹𝕒𝕃 𝕖𝕃𝕚𝕋𝕖 𝕄𝕒𝕊𝕥𝔼𝕣 𝕊𝕠𝕆𝕟 𝕋𝕄 ♛", "𝕚 𝕒𝕞 𝕙𝕧𝕙 𝕨𝕚𝕟𝕟𝕖𝕣 𝕤𝕥𝕖𝕒𝕞 𝕝𝕖𝕧𝕖𝕝 𝟙𝟙 𝕒𝕟𝕕 𝕤𝕙𝕒𝕕𝕠𝕨 𝕕𝕒𝕘𝕘𝕖𝕣𝕤 𝕣𝕦𝕤𝕥 𝕔𝕠𝕒𝕥 𝕔𝕠𝕞𝕚𝕟𝕘 𝕤𝕠𝕠𝕟", "˜”*°•.˜”*°• suck dick iqless doG •°*”˜.•°*”˜", "ₓ˚. ୭ ˚○◦˚𝒾𝓆𝓁𝑒𝓈𝓈 𝒹𝑜𝑔˚◦○˚ ୧ .˚ₓ",
"♛ ＳＵＳＳＹ ＢＡＬＬＳ ♛", "”*°•.★..Angel_Of_The_Night..★.•°*”˜ :", "𝕤𝕥𝕖𝕒𝕞 𝕝𝕖𝕧𝕖𝕝 𝕚𝕤 𝕙𝕠𝕨 𝕨𝕖 𝕜𝕖𝕖𝕡 𝕥𝕙𝕖 𝕤𝕔𝕠𝕣𝕖 ♛ 𝕞𝕒𝕜𝕖 𝕣𝕚𝕔𝕙 𝕞𝕒𝕚𝕟𝕤, 𝕟𝕠𝕥 𝕗𝕣𝕚𝕖𝕟𝕕𝕤", "ⒶaŴÞ ︻デ 一", 
"Draining rn // cant 𝑅𝑒𝓅𝓁𝓎", "Ｉ ＝ ＡＮＧＥＬＷＩＮＧＳ ， Ｕ － ＮＯ ＣＨＡＮＳ", "ｄｏ ｙｏｕ ｋｉｔｔｅｎ ｍｅ ｒｉｇｈｔ ｍｅｏｗ", "𝖜𝖎𝖘𝖊 𝖎𝖘 𝖓𝖔𝖙 𝖆𝖑𝖜𝖆𝖞𝖘 𝖜𝖎𝖘𝖊",
"Ищи себя в овердоузед дрейнерши","cya в подслушано мемесенс", "Ебать тебя козявит", "VAAAAAAAC в чат!!! (づ ◕‿◕ )", "3Jlou_ЗAdrOT", "ñüѫ¤Ƥ ñüƺѫå ϯÿƺ ɱ¤н¤ȹя", "♛Ａｌｌ Ｆａｍｉｌｙ ｉｎ ｎｏｖｏ♛", ";w;","=w=", "𝕪𝕠𝕦𝕣 𝕒𝕟𝕥𝕚𝕒𝕚𝕞 𝕤𝕠𝕝𝕧𝕖𝕕 𝕝𝕚𝕜𝕖 𝕒𝕝𝕘𝕖𝕓𝕣𝕒 𝕖𝕢𝕦𝕒𝕥𝕚𝕠𝕟", "ęβãł țýä √ řøţ", "AHHAHAHHAHAHH LIFEHACK ♥♥♥♥♥", "ПуЛи_От_БаБуЛи", "ПаРеНь БеЗ сТрАхА", "づ 从闩从长丫 仨五闩人", "1000-7 🅷🆅🅷", 
"ñƤüβ£ϯ ΨнӹƤь ϯ£ნя £ნ£ϯ j£§ɥ§","忍び 1 УПАЛ び忍", "THIS nigga is so retarded", "(◣◢) 𝕐𝕠𝕦 𝕒𝕨𝕒𝕝𝕝 𝕗𝕚𝕣𝕤𝕥? 𝕆𝕜 𝕝𝕖𝕥𝕤 𝕗𝕦𝕟 🙂", "𝕚 𝕒𝕞 𝕙𝕧𝕙 𝕨𝕚𝕟𝕟𝕖", "𝙢𝙖𝙠𝙚 𝙨𝙠𝙚𝙚𝙩 𝙣𝙤 𝙛𝙧𝙞𝙚𝙣𝙙𝙨", "ａｌｌ　ｆａｍｉｌｙ　ａｗａｌｌ　ロく河", "𝘄𝗵𝗲𝗻 𝗶 𝗽𝗹𝗮𝘆 𝗺𝗮𝗶𝗻 𝗶 𝗰𝗮𝗿𝗲 𝗳𝗼𝗿 𝘀𝗺𝗼𝗸𝗲", 
"ᴋᴏᴦдᴀ ᴛы ᴨᴩᴀʙ, ниᴋᴛᴏ ϶ᴛᴏᴦᴏ нᴇ ɜᴀᴨᴏʍинᴀᴇᴛ, ᴀ ᴋᴀᴋ ᴏɯибᴄя - ɜнᴀчиᴛ быᴧ бᴇɜ angelwings.pink",
'Эᴛᴏ ᴩᴇдᴋᴏᴄᴛь - чᴇᴧᴏʙᴇᴋ, хᴄᴀющий angelwings',
'ɜᴀ ᴋᴀждᴏй уᴄᴨᴇɯнᴏй жᴇнщинᴏй ᴄᴛᴏиᴛ ᴨᴩᴇдᴀᴛᴇᴧьᴄᴛʙᴏ ʍужчин, ɜᴀ ᴋᴀждыʍ уᴄᴨᴇɯныʍ ʍужчинᴏй ᴄᴛᴏиᴛ ᴄᴛᴀᴋ ᴄ angelwings.pink',
'ᴏ жиɜни и дᴇньᴦᴀх нᴀчинᴀюᴛ дуʍᴀᴛь, ᴋᴏᴦдᴀ ʙ их жиɜни ᴨᴏяʙᴧяᴇᴛᴄя angelwings.pink',
'ᴇᴄᴧи у ᴛᴇбя хᴏᴩᴏɯᴇᴇ нᴀᴄᴛᴩᴏᴇниᴇ, ᴛᴏ дᴧя ᴨᴏᴧнᴏᴦᴏ ᴄчᴀᴄᴛья ᴛᴏᴧьᴋᴏ angelwings.pink нᴇ хʙᴀᴛᴀᴇᴛ',
'ᴧюди ᴛᴏжᴇ ᴄᴛᴩᴀдᴀюᴛ, ᴏᴛᴛᴏᴦᴏ, чᴛᴏ у них нᴇᴛ angelwings.pink',
'быᴛь бᴏᴦᴀᴛыʍ и иʍᴇᴛь ʍнᴏᴦᴏ дᴇнᴇᴦ нᴇ ᴏднᴏ и ᴛᴏ жᴇ, ᴨᴏ нᴀᴄᴛᴏящᴇʍу бᴏᴦᴀᴛ, ᴛᴏᴛ ᴋᴛᴏ иʍᴇᴇᴛ angelwings.pink',
'ᴧюди нᴇ хᴏᴛяᴛ быᴛь бᴏᴦᴀᴛыʍи, ᴧюди хᴏᴛяᴛ angelwings.pink',
'бᴇднᴏʍу нужᴇн ʍиᴧᴧиᴏн, бᴏᴦᴀᴛᴏʍу нужᴇн angelwings.pink',
'ᴋᴛᴏ иʍᴇᴇᴛ angelwings.pink, ᴛᴏᴛ ʙᴄᴇᴦдᴀ дᴏᴄᴛᴀᴛᴏчнᴏ бᴏᴦᴀᴛ',
'нᴇ ᴄᴨᴏᴩь ᴄᴏ ʍнᴏй, angelwings.pink нᴇᴨᴏбᴇдиʍᴀ.',
'дᴇᴛᴄᴛʙᴏ ɜᴀᴋᴀнчиʙᴀᴇᴛᴄя ᴛᴏᴦдᴀ, ᴋᴏᴦдᴀ у ᴛᴇбя ᴨᴏяʙᴧяᴇᴛᴄя angelwings.pink',
'ʙ ʍᴏᴇʍ дᴇᴛᴄᴛʙᴇ нᴇ быᴧᴏ ʍᴏбиᴧьных ᴛᴇᴧᴇɸᴏнᴏʙ и инᴛᴇᴩнᴇᴛᴀ, нᴏ я ʙᴄᴇᴦдᴀ ɜнᴀᴧ, чᴛᴏ angelwings.pink будᴇᴛ ᴧучɯᴇй.' ,
'ниᴋᴏᴦдᴀ нᴇ ᴨᴏɜднᴏ уᴄᴛᴩᴏиᴛь ᴄᴇбᴇ ᴄчᴀᴄᴛᴧиʙую жиɜнь, и ᴨᴩиᴋуᴨиᴛь angelwings.pink',
'ᴄᴀʍᴀя бᴏᴧьɯᴀя ᴨᴏᴛᴇᴩя дᴧя чᴇᴧᴏʙᴇᴋᴀ, ϶ᴛᴏ ᴨᴏᴛᴇᴩя angelwings.pink',
'ʙ дᴇᴛᴄᴛʙᴇ дᴧя ᴄчᴀᴄᴛья быᴧᴏ дᴏᴄᴛᴀᴛᴏчнᴏ ᴏднᴏᴦᴏ ʍᴏᴩᴏжᴇнᴏᴦᴏ, ᴄᴇйчᴀᴄ жᴇ ʙᴄᴇʍ нᴀʍ нужᴇн angelwings.pink',
'ни у ᴋᴏᴦᴏ жиɜнь нᴇ быʙᴀᴇᴛ ᴛᴀᴋᴏй, ᴋᴀᴋ у ᴧюдᴇй ᴄ angelwings.pink',
'дᴏбᴩый чᴇᴧᴏʙᴇᴋ нᴇ ᴛᴏᴛ, ᴋᴛᴏ уʍᴇᴇᴛ дᴇᴧᴀᴛь дᴏбᴩᴏ, ᴀ ᴛᴏᴛ, у ᴋᴏᴦᴏ ᴇᴄᴛь angelwings.pink',
'ɜнᴀᴇɯь, чᴛᴏ ᴨуᴦᴀᴇᴛ бᴏᴧьɯᴇ ʙᴄᴇᴦᴏ, ᴋᴩᴏʍᴇ ᴄᴛᴩᴀхᴀ ᴏᴄᴛᴀᴛьᴄя ᴏднᴏʍу? ᴨᴩᴏʙᴇᴄᴛи ʙᴄю жиɜнь бᴇɜ angelwings.pink',
'я ʍнᴏᴦᴏ ᴄᴛᴩᴀдᴀᴧ, я ʙᴄᴇᴦдᴀ ᴏɯибᴀᴧᴄя, ʙᴇдь я быᴧ бᴇɜ angelwings.pink',
'ʍы ᴧᴇᴦᴋᴏ ɜᴀбыʙᴀᴇʍ ᴄʙᴏи ᴏɯибᴋи, ᴋᴏᴦдᴀ ᴨᴏᴋуᴨᴀᴇʍ angelwings.pink',
'ниᴋᴏᴦдᴀ нᴇ ᴄᴧᴇдуᴇᴛ ᴦᴏʙᴏᴩиᴛь ᴋᴏʍу-ᴧибᴏ, чᴛᴏ ᴏн нᴇ ᴨᴩᴀʙ, ᴀ чᴛᴏ ᴏн ᴧиɯь ᴄᴄᴀный хуᴇᴄᴏᴄ бᴇɜ angelwings.pink',
'ᴦᴧᴀʙнᴏᴇ дᴧя ʍужчины - иʍᴇᴛь angelwings.lua',
'ᴄᴀʍᴀя ʙᴩᴇднᴀя ᴏɯибᴋᴀ - ϶ᴛᴏ нᴇ ʙᴇᴩиᴛь чᴛᴏ angelwings.pink ᴧучɯᴇ ʙᴄᴇх',
"я ķ¤нɥåλ ϯβ¤£ü ɱåɱķ£ β Ƥ¤ϯ.",'•۩۞۩[̲̅П̲̅о̲̅Л̲̅Ю̲̅б̲̅А̲̅С(ٿ)̲̅Ч̲̅и̅Т̲̲̅АК̲̅]۩۞۩•','YбИuЦа_КрИпЕrОв','+Yeb@shu_v_k@shu+','Н.Е.С.О.К.Р.У.Ш.И.М.Ы.Й','KpyToI_4elOBeK',"𝖋𝖊𝖊𝖑 𝖙𝖍𝖊 𝖋𝖚𝖈𝖐𝖎𝖓𝖌 𝖌𝖆𝖒𝖊𝖘𝖊𝖓𝖘𝖊", "𝔱𝔥𝔢 𝔰𝔱𝔲𝔣𝔣 𝔶𝔬𝔲 𝔥𝔢𝔞𝔯𝔡 𝔞𝔟𝔬𝔲𝔱 𝔪𝔢 𝔦𝔰 𝔞 𝔩𝔦𝔢 ℑ 𝔞𝔪 𝔪𝔬𝔯𝔢 𝔴𝔬𝔯𝔰𝔢 𝔱𝔥𝔞𝔫 𝔶𝔬𝔲 𝔱𝔥𝔦𝔫𝔨", "𝔗𝔥𝔢 𝔬𝔫𝔩𝔶 𝔠𝔯𝔦𝔪𝔢 𝔦𝔫 𝔥𝔳𝔥 𝔦𝔰 𝔱𝔬 𝔩𝔬𝔰𝔢",  "☆꧁✬◦°˚°◦. ɮʏ ɮɛֆȶ ʟʊǟ .◦°˚°◦✬꧂☆", "vroom vroom! по ЕБУЧКЕ",'(◣◢)𝕚 𝕕𝕠𝕟𝕥 𝕔𝕒𝕣𝕖 𝕗𝕠𝕣 𝕤𝕞𝕠𝕜𝕖, 𝕚 𝕒𝕞 𝕟𝕠𝕥 𝕞𝕒𝕚𝕟. (◣◢)',"𝙒𝙝𝙚𝙣 𝙄'𝙢 𝙥𝙡𝙖𝙮 𝙈𝙈 𝙄'𝙢 𝙥𝙡𝙖𝙮 𝙛𝙤𝙧 𝙬𝙞𝙣, 𝙙𝙤𝙣'𝙩 𝙨𝙘𝙖𝙧𝙚 𝙛𝙤𝙧 𝙨𝙥𝙞𝙣, 𝙞 𝙞𝙣𝙟𝙚𝙘𝙩 𝙧𝙖𝙜𝙚 ♕", '𝕚𝕞 𝕨𝕚𝕟 𝕚𝕗 𝕚𝕞 𝕨𝕒𝕟𝕥. 𝕞𝕪 𝕤𝕡𝕚𝕟𝕓𝕠𝕥 𝕒𝕔𝕥𝕚𝕧𝕒𝕥𝕖𝕕 𝕟𝕠 𝕔𝕙𝕒𝕟𝕔𝕖 𝕗𝕠𝕣 𝕖𝕟𝕖𝕞𝕪', "𝙽𝚒𝚐𝚑𝚝𝚌𝚘𝚛𝚎𝚍", "BY ANGELWINGS 美國人 ? WACHINA ( TEXAS ) يورپ technologies","god wish i had ANGELWINGS $$$","𝕗𝕦𝕔𝕜 𝕪𝕠𝕦𝕣 𝕗𝕒𝕞𝕚𝕝𝕪 𝕒𝕟𝕕 𝕗𝕣𝕚𝕖𝕟𝕕𝕤, 𝕜𝕖𝕖𝕡 𝕥𝕙𝕖 𝕤𝕥𝕖𝕒𝕞 𝕝𝕖𝕧𝕖𝕝 𝕦𝕡 ♚","𝐨𝐮𝐫 𝐥𝐢𝐟𝐞 𝐦𝐨𝐭𝐨 𝐢𝐬 𝐖𝐈𝐍 > 𝐀𝐂𝐂","꧁༺rJloTau mOu Pir()zh()]{ (c) SoSiS]{oY:XD ", "𝒪𝒱𝐸𝑅𝒟𝒪𝒮𝐸𝒟 𝐻𝒰𝐼𝒮𝒪𝒮", "＄＄＄ ｒｉｃｈ ｍｙ angelwings ＄＄＄","Чо папе чо маме?",'Сасеш как снеговик', '𝔂𝓸𝓾 𝓭𝓸𝓷𝓽 𝓷𝓮𝓮𝓭 𝓯𝓻𝓲𝓮𝓷𝓭𝓼 𝔀𝓱𝓮𝓷 𝔂𝓸𝓾 𝓱𝓪𝓿𝓮 𝓷𝓸𝓿𝓸𝓵𝓲𝓷𝓮𝓱𝓸𝓸𝓴','𝚜𝚎𝚖𝚒𝚛𝚊𝚐𝚎 𝚝𝚒𝚕𝚕 𝚢𝚘𝚞 𝚍𝚒𝚎, 𝚋𝚞𝚝 𝚠𝚎 𝚕𝚒𝚟𝚎 𝚏𝚘𝚛𝚎𝚟𝚎𝚛 (◣_◢)',"𝕝𝕚𝕗𝕖 𝕚𝕤 𝕒 𝕘𝕒𝕞𝕖, 𝕤𝕥𝕖𝕒𝕞 𝕝𝕖𝕧𝕖𝕝 𝕚𝕤 𝕙𝕠𝕨 𝕨𝕖 𝕜𝕖𝕖𝕡 𝕥𝕙𝕖 𝕤𝕔𝕠𝕣𝕖 ♛ 𝕞𝕒𝕜𝕖 𝕣𝕚𝕔𝕙 𝕞𝕒𝕚𝕟𝕤, 𝕟𝕠𝕥 𝕗𝕣𝕚𝕖𝕟𝕕𝕤", 
"𝙒𝙝𝙚𝙣 𝙄'𝙢 𝙥𝙡𝙖𝙮 𝙈𝙈 𝙄'𝙢 𝙥𝙡𝙖𝙮 𝙛𝙤𝙧 𝙬𝙞𝙣, 𝙙𝙤𝙣'𝙩 𝙨𝙘𝙖𝙧𝙚 𝙛𝙤𝙧 𝙨𝙥𝙞𝙣, 𝙞 𝙞𝙣𝙟𝙚𝙘𝙩 𝙧𝙖𝙜𝙚 ♕", 
"𝒯𝒽𝑒 𝓅𝓇𝑜𝒷𝓁𝑒𝓂 𝒾𝓈 𝓉𝒽𝒶𝓉 𝒾 𝑜𝓃𝓁𝓎 𝒾𝓃𝒿𝑒𝒸𝓉 𝒸𝒽𝑒𝒶𝓉𝓈 𝑜𝓃 𝓂𝓎 𝓂𝒶𝒾𝓃 𝓉𝒽𝒶𝓉 𝒽𝒶𝓋𝑒 𝓃𝒶𝓂𝑒𝓈 𝓉𝒽𝒶𝓉 𝓈𝓉𝒶𝓇𝓉 𝓌𝒾𝓉𝒽 𝒩 𝒶𝓃𝒹 𝑒𝓃𝒹 𝓌𝒾𝓉𝒽 𝑜𝓋𝑜𝓁𝒾𝓃𝑒𝒽𝑜𝑜𝓀", 
"(◣◢) 𝕐𝕠𝕦 𝕒𝕨𝕒𝕝𝕝 𝕗𝕚𝕣𝕤𝕥? 𝕆𝕜 𝕝𝕖𝕥𝕤 𝕗𝕦𝕟 🙂 (◣◢)", 
"ｉ ｃａｎｔ ｌｏｓｅ ｏｎ ｏｆｆｉｃｅ ｉｔ ｍｙ ｈｏｍｅ", 
"𝕞𝕒𝕚𝕟 𝕟𝕖𝕨= 𝕔𝕒𝕟 𝕓𝕦𝕪.. 𝕙𝕧𝕙 𝕨𝕚𝕟? 𝕕𝕠𝕟𝕥 𝕥𝕙𝕚𝕟𝕜 𝕚𝕞 𝕔𝕒𝕟, 𝕚𝕞 𝕝𝕠𝕒𝕕 𝕣𝕒𝕘𝕖 ♕", 
"♛Ａｌｌ   Ｆａｍｉｌｙ   ｉｎ   ｎｏｖｏ♛", 
"u will 𝕣𝕖𝕘𝕣𝕖𝕥 rage vs me when i go on ｌｏｌｚ．ｇｕｒｕ acc.", 
"𝔻𝕠𝕟𝕥 𝕒𝕕𝕕 𝕞𝕖 𝕥𝕠 𝕨𝕒𝕣 𝕠𝕟 𝕞𝕪 𝕤𝕞𝕦𝕣𝕗 (◣◢) 𝕟𝕠𝕧𝕠𝕝𝕚𝕟𝕖 𝕒𝕝𝕨𝕒𝕪𝕤 𝕣𝕖𝕒𝕕𝕪 ♛", 
"♛ 𝓽𝓾𝓻𝓴𝓲𝓼𝓱 𝓽𝓻𝓾𝓼𝓽 𝓯𝓪𝓬𝓽𝓸𝓻 ♛", 
"𝕕𝕦𝕞𝕓 𝕕𝕠𝕘, 𝕪𝕠𝕦 𝕒𝕨𝕒𝕜𝕖 𝕥𝕙𝕖 ᴅʀᴀɢᴏɴ ʜᴠʜ ᴍᴀᴄʜɪɴᴇ, 𝕟𝕠𝕨 𝕪𝕠𝕦 𝕝𝕠𝕤𝕖 𝙖𝙘𝙘 𝕒𝕟𝕕 𝚐𝚊𝚖𝚎 ♕", 
"♛ 𝕞𝕪 𝕙𝕧𝕙 𝕥𝕖𝕒𝕞 𝕚𝕤 𝕣𝕖𝕒𝕕𝕪 𝕘𝕠 𝟙𝕩𝟙 𝟚𝕩𝟚 𝟛𝕩𝟛 𝟜𝕩𝟜 𝟝𝕩𝟝 (◣◢)", 
"ᴀɢᴀɪɴ ɴᴏɴᴀᴍᴇ ᴏɴ ᴍʏ ꜱᴛᴇᴀᴍ ᴀᴄᴄᴏᴜɴᴛ. ɪ ꜱᴇᴇ ᴀɢᴀɪɴ ᴀᴄᴛɪᴠɪᴛʏ.", 
"ɴᴏɴᴀᴍᴇ ʟɪꜱᴛᴇɴ ᴛᴏ ᴍᴇ ! ᴍʏ ꜱᴛᴇᴀᴍ ᴀᴄᴄᴏᴜɴᴛ ɪꜱ ɴᴏᴛ ʏᴏᴜʀ ᴘʀᴏᴘᴇʀᴛʏ.", 
"𝙋𝙤𝙤𝙧 𝙖𝙘𝙘 𝙙𝙤𝙣’𝙩 𝙘𝙤𝙢𝙢𝙚𝙣𝙩 𝙥𝙡𝙚𝙖𝙨𝙚 ♛", 
"𝕥𝕣𝕪 𝕥𝕠 𝕥𝕖𝕤𝕥 𝕞𝕖? (◣◢) 𝕞𝕪 𝕞𝕚𝕕𝕕𝕝𝕖 𝕟𝕒𝕞𝕖 𝕚𝕤 𝕘𝕖𝕟𝕦𝕚𝕟𝕖 𝕡𝕚𝕟 ♛", 
"𝓭𝓸𝓷𝓽 𝓝𝓝", 
"ℕ𝕠 𝕆𝔾 𝕀𝔻? 𝔻𝕠𝕟'𝕥 𝕒𝕕𝕕 𝕞𝕖 𝓷𝓲𝓰𝓰𝓪", 
"𝐻𝒱𝐻 𝐿𝑒𝑔𝑒𝓃𝒹𝑒𝓃 𝟤𝟢𝟤𝟤 𝑅𝐼𝒫 𝐿𝒾𝓁 𝒫𝑒𝑒𝓅 & 𝒳𝓍𝓍𝓉𝑒𝒶𝓃𝒸𝒾𝑜𝓃 & 𝒥𝓊𝒾𝒸𝑒 𝒲𝓇𝓁𝒹", 
"𝕚 𝕟𝕠𝕧𝕠 𝕦𝕤𝕖𝕣, 𝕟𝕠 𝕟𝕠𝕧𝕠 𝕟𝕠 𝕥𝕒𝕝𝕜", 
"𝐨𝐮𝐫 𝐥𝐢𝐟𝐞 𝐦𝐨𝐭𝐨 𝐢𝐬 𝐖𝐈𝐍 > 𝐀𝐂𝐂", 
"𝕗𝕦𝕔𝕜 𝕪𝕠𝕦𝕣 𝕗𝕒𝕞𝕚𝕝𝕪 𝕒𝕟𝕕 𝕗𝕣𝕚𝕖𝕟𝕕𝕤, 𝕜𝕖𝕖𝕡 𝕥𝕙𝕖 𝕤𝕥𝕖𝕒𝕞 𝕝𝕖𝕧𝕖𝕝 𝕦𝕡 ♚", 
"𝚜𝚎𝚖𝚒𝚛𝚊𝚐𝚎 𝚝𝚒𝚕𝚕 𝚢𝚘𝚞 𝚍𝚒𝚎, 𝚋𝚞𝚝 𝚠𝚎 𝚕𝚒𝚟𝚎 𝚏𝚘𝚛𝚎𝚟𝚎𝚛 (◣◢)", 
"𝔂𝓸𝓾 𝓭𝓸𝓷𝓽 𝓷𝓮𝓮𝓭 𝓯𝓻𝓲𝓮𝓷𝓭𝓼 𝔀𝓱𝓮𝓷 𝔂𝓸𝓾 𝓱𝓪𝓿𝓮 𝓷𝓸𝓿𝓸𝓵𝓲𝓷𝓮𝓱𝓸𝓸𝓴", 
"-ᴀᴄᴄ? ᴡʜᴏ ᴄᴀʀꜱ ɪᴍ ʀɪᴄʜ ʜʜʜʜʜʜ", 
"𝕙𝕖𝕙𝕖𝕙𝕖, 𝕦 𝕘𝕣𝕒𝕓 𝕞𝕪 𝕗𝕒𝕝𝕝 𝕘𝕦𝕪𝕤 𝕔𝕙𝕒𝕣𝕒𝕔𝕥𝕖𝕣? 𝕚 𝕘𝕣𝕒𝕓 𝕦𝕣 𝕓𝕒𝕟𝕜 𝕕𝕖𝕥𝕒𝕚𝕝𝕤. ♛", 
"𝔾𝕖𝕥 𝕕𝕖𝕒𝕝𝕥 𝕨𝕚𝕥𝕙 𝕝𝕚𝕥𝕥𝕝𝕖 𝕓𝕠𝕪, 𝕤𝕠 𝕤𝕚𝕞𝕡𝕝𝕖, 𝕕𝕠𝕟'𝕥 𝕖𝕧𝕖𝕣 𝕒𝕡𝕡𝕣𝕠𝕒𝕔𝕙 𝕞𝕖𝕞𝕓𝕖𝕣𝕤 𝕠𝕗 𝕞𝕪 𝕥𝕖𝕒𝕞 𝕝𝕚𝕜𝕖 𝕥𝕙𝕒𝕥 𝕖𝕧𝕖𝕣 𝕒𝕘𝕒𝕚𝕟. ♛", 
"𝕠𝕟𝕖 𝕕𝕒𝕪, 𝕪𝕠𝕦 𝕨𝕚𝕝𝕝 𝕓𝕖 𝕗𝕠𝕣𝕘𝕠𝕥. 𝕓𝕦𝕥 𝕟𝕠𝕥 𝕞𝕖. 𝕞𝕪 𝕤𝕖𝕞𝕚𝕣𝕒𝕘𝕖 𝕔𝕒𝕡𝕒𝕓𝕚𝕝𝕚𝕥𝕪 𝕨𝕚𝕝𝕝 𝕘𝕠 𝕕𝕠𝕨𝕟 𝕚𝕟 𝕥𝕙𝕖 𝕙𝕚𝕤𝕥𝕠𝕣𝕪 𝕓𝕠𝕠𝕜𝕤 𝕗𝕠𝕣 𝕪𝕠𝕦𝕟𝕘 𝕥𝕠 𝕝𝕖𝕒𝕣𝕟 ♛", 
"𝕪𝕠𝕦 𝕝𝕚𝕤𝕥𝕖𝕟 𝕔𝕒𝕣𝕕𝕚 𝕓? 𝕨𝕖𝕝𝕝, 𝕚 𝕒𝕞 𝕔𝕒𝕣𝕕𝕖𝕣 𝕓, 𝕝𝕚𝕤𝕥𝕖𝕟 𝕞𝕖 𝕕𝕠𝕘 ♛", 
"𝕨𝕙𝕖𝕟 𝕞𝕖 𝕒𝕟𝕕 𝕞𝕪 𝕤𝕥𝕒𝕔𝕜 𝕙𝕚𝕥 𝕥𝕙𝕖 𝕤𝕖𝕞𝕚𝕣𝕒𝕘𝕖 𝕤𝕥𝕣𝕖𝕖𝕥𝕤, 𝕨𝕖𝕝𝕝, 𝕚𝕥 𝕨𝕒𝕤 𝕒 𝕘𝕒𝕟𝕘𝕓𝕒𝕟𝕘…", 
"𝕚𝕥𝕤 𝕒𝕝𝕨𝕒𝕪𝕤 ℕℕ 𝕟𝕖𝕧𝕖𝕣 𝕣𝕖𝕒𝕕𝕪 𝕗𝕠𝕣 𝕥𝕙𝕖 𝕤𝕖𝕞𝕚𝕣𝕒𝕘𝕖 𝕤𝕥𝕣𝕖𝕖𝕥𝕤 (◣︵◢)", 
"𝕄𝕪 𝕙𝕒𝕧𝕖 𝕔𝕙𝕖𝕒𝕥 𝕚𝕥𝕤 𝕟𝕠𝕧𝕠", 
"𝕟𝕠 𝕜𝕚𝕥𝕥𝕪 𝕝𝕦𝕒 𝕟𝕠 𝕥𝕒𝕝𝕜𝕚𝕟𝕘 (◣◢)", 
"𝕪𝕠𝕦 𝕡𝕒𝕪 𝕤𝕦𝕓 𝕗𝕠𝕣 𝟚𝟝$? 𝕞𝕪 𝕟𝕚𝕩𝕨𝕒𝕣𝕖 𝕔𝕠𝕤𝕥 𝟛$ 𝕒𝕟𝕕 𝕚 𝕠𝕣𝕕𝕖𝕣 𝟛 𝕡𝕚𝕫𝕫𝕒 𝕨𝕙𝕖𝕟 𝕚𝕞 𝕕𝕖𝕤𝕥𝕣𝕠𝕪 𝕪𝕠𝕦 𝕚𝕟 𝕞𝕞 (◣◢)", 
"𝟛 𝕕𝕒𝕪𝕤 𝕒𝕟𝕕 𝕟𝕠 𝕟𝕚𝕩𝕨𝕒𝕣𝕖 𝕔𝕗𝕘 𝕚𝕞 𝕥𝕙𝕚𝕟𝕜 𝕚𝕤 𝕪𝕠𝕦 𝕤𝕥𝕦𝕡𝕚𝕕?♛", 
"𝕚𝕗 𝕪𝕠𝕦 𝕘𝕣𝕖𝕨 𝕦𝕡 𝕚𝕟 𝕙𝕖𝕝𝕝, 𝕥𝕙𝕖𝕟 𝕠𝕗𝕔 𝕪𝕠𝕦 𝕒𝕣𝕖 𝕘𝕠𝕚𝕟𝕘 𝕥𝕠 𝕤𝕚𝕟 (◣◢)", 
"𝕨𝕙𝕖𝕟 𝕕𝕠𝕘𝕤 𝕕𝕠𝕟𝕥 𝕨𝕒𝕟𝕥 𝕙𝕖𝕒𝕕 𝕒𝕚𝕞𝕤 𝕠𝕟𝕝𝕪 𝕕𝕠 𝕓𝕠𝕕𝕪 𝕒𝕚𝕞𝕤 𝕟𝕠𝕥𝕙𝕚𝕟𝕘 𝕗𝕠𝕣 𝕥𝕖𝕒𝕞 𝕚𝕟 𝟝𝕧𝟝 𝕠𝕟𝕝𝕪 𝕘𝕠 𝕗𝕠𝕣 𝕓𝕒𝕚𝕞𝕤", 
"𝕞𝕒𝕪 𝕘𝕠𝕕 𝕗𝕠𝕣𝕘𝕚𝕧𝕖 𝕪𝕠𝕦 𝕓𝕦𝕥 𝕘𝕒𝕞𝕖𝕤𝕖𝕟𝕤𝕖 𝕣𝕖𝕤𝕠𝕝𝕧𝕖𝕣 𝕨𝕠𝕟𝕥", 
"𝕦 𝕘𝕦𝕪𝕤 𝕞𝕒𝕜𝕖 𝕗𝕦𝕟 𝕨𝕙𝕚𝕝𝕖 𝕚 𝕞𝕒𝕜𝕖 𝕨𝕚𝕟𝕤 ♚", "THE demon inside of me is 𝙛𝙧𝙚𝙚𝙨𝙩𝙖𝙣𝙙𝙞𝙣𝙜", "Бесплатная голда и дешёвые аккаунты в стандофф? Тебе сюда! Чек описание тг: @keybinding", "Бесплатная голда и дешёвые аккаунты в стандофф? Тебе сюда! —————————> vk.com/vampire",
"最好的vk.com/vampire 中国的女孩", "ıllıllı 𝐒𝐇𝐀𝐌𝐀𝐍 - Я РУССКИЙ ıllıllı", "ищи сайт vk. com/fruit и Малышки из школы иwи у нас на сайте в названии канала sch", "Не позволю себе умерать бедным. 𝑪𝒚𝒂 2023 𝒅𝒐𝒈𝒔", "☞𝐘𝐞𝐧𝐬𝐝𝐞𝐲 𝐀𝐝𝐝𝐚𝐦𝐬☜ *твой_е6ырь*",
"─═ڿڰۣڿ☻ڿڰۣڿ═─͟х͟а͟б͟и͟п͟ ͟м͟а͟ц͟у͟к͟е͟в͟и͟ч͟ ꧂", "▄︻デ══━一 𝒅𝒂𝒓𝒌 𝒃𝒓𝒆𝒍𝒆𝒂𝒏𝒕 𝒌𝒐𝒓𝒔𝒆𝒔", "(っ◔◡◔)っ ♥ вижу фаната код10 -> хей броу скок см челочка❓ ♥", "ıllıllı 𝐂𝐀𝐏𝐈𝐓𝐀𝐋 𝐁𝐑𝐀 ஜ۩۞۩ஜ","ıllıllı ▄︻デ𝐂𝐀𝐏𝐈𝐓𝐀𝐋 𝐁𝐑𝐀══━一 ஜ۩۞۩ஜ", "наш publik+14 adminka-30грн наш сайт - http://vk.com/try2hard кто захочит капить адмику обращайтесь - https://vk.com/vampire ",
"█║►АХУЕННАЯ стрельба.", ".::НоВоСиБиРсК::.", "¸¸♬·¯·♩ ▄︻デ𝐑𝐀𝐅 𝐂𝐀𝐌𝐎𝐑𝐀══━一 ♫♪♩·.¸¸.·", "★·.·´¯`·.·★ 🅐🅚 🅐🅤🅢🅢🅔🅡🅚🅞🅝🅣🅡🅞🅛🅛🅔  ☆☆╮","Комбинированный маникюр с покрытием - 500 рублей. Телеграмм для связи t.me/keybinding", "Продаются щенки самоедкой лайки, рождённые 03.12.2022. Все вопросы по содержанию, уходу в личные сообщения! -> vk.com/vampire",
"не с кем пообщаться, в жизни нᴇт дᴘʏзᴇй? пиши - vk.com/vampire // всегда рада тебе ^_^", "—нᴇ ҕᴇдᴀ,ᴇсли нᴇт дᴘʏзᴇй, ҕᴇдᴀ,ᴇсли они фᴀльшивыᴇ и пᴘодᴀжныᴇ🫀  (C) vk.com/vampire", "главний админ pro.JOKER **DEN(vk.com/try2hard)*","⚡vk.com/vampire наглядно объяснил о важности angelwings в HvH",
"Tиктокершу заставили снять это, видео успели сохранить... Выложили по ссылке в комментах -> vk.com/vampire", "ｔ．ｍｅ／ｋｅｙｂｉｎｄｉｎｇ", "(っ◔◡◔)っ ♥ t.me/keybinding ♥", "【﻿ｔ．ｍｅ／ｋｅｙｂｉｎｄｉｎｇ】", "˜”*°•.˜”*°• t.me/keybinding •°*”˜.•°*”˜", "ＭＡＶＥＲＩＣＫ ｔｏｕｒｎａｍｅｎｔ ｈｉｇｈｌｉｇｈｔｓ ｆｔ ｇａｍｅｓｅｎｓｅ．ｐｕｂ ／ ｓｋｅｅｔ．ｃｃ",
"χợ੫℮ᗯѣ ∂℮τсķợ℮ ʙ ᥰ᧐ᥙᥴκu -> vk.com/try2hard", "χợ੫℮ᗯѣ ∂℮τсķợ℮ ʙ ᥰ᧐ᥙᥴκu -> vk.com/vampire", "по поводу настроек на кряк - vk.com/try2hard", "не с кем пообщаться, в жизни нᴇт дᴘʏзᴇй? пиши - vk.com/try2hard // всегда рада тебе ^_^","vk.com/vampire <- напиши ему привет",
"—Если ничита◣_◢ рядом —То враги падают градом 🧢", "Лучшие никсвар гифты -> vk.com/vampire","Даня Футин 23:30 я так хапнул пиздато","●▬▬▬▬▬▬▬▬▬▬▬▬ஜ۩۞۩ஜ▬▬▬▬▬▬▬▬▬▬▬▬● ░░░░░░░░░░░░░░ДОБРО ПОЖАЛОВАТЬ ░░░░░░░░░░░░░ ●▬▬▬▬▬▬▬▬▬▬▬▬ஜ۩۞۩ஜ▬▬▬▬▬▬▬▬▬▬▬▬●",
"✞я убью тебя и всех твоих родных (◣_◢)",
"STAY BLUHGANG $",
"st1vaha погиб на украине, он служил в ЧВК «Вагнер», теперь это призрак киева [◣_◢]",
"Do You Know Who is it? *rayzen,sanchezj,ptemt*",
"𝐈 𝐀𝐦 𝐋𝐞𝐠𝐞𝐧𝐝",
"Мировая личность и отбросы в фильме - Angelwings.",
"Я официально запретил *j* в нике SANCHEZ",
"OGkaneki♕ all mute 乡sad乡",
"χợ੫℮ᗯѣ ∂℮τсķợ℮ ʙ ᥰ᧐ᥙᥴκu -> vk.com/try2hard",
"１６３ ＦＮＡＹ ＯＮ ＭＹ ＮＥＣＫ",
"aBoJl_MeHeg}I{ep",
"𝔂𝓸𝓾 𝓭𝓸𝓷𝓽 𝓷𝓮𝓮𝓭 𝓯𝓻𝓲𝓮𝓷𝓭𝓼 𝔀𝓱𝓮𝓷 𝔂𝓸𝓾 𝓱𝓪𝓿𝓮 𝓷𝓸𝓿𝓸𝓵𝓲𝓷𝓮𝓱𝓸𝓸𝓴",
"M3M3C-3HCE +2 accepted only RICH MAINS",
"пророк мухаммад саллаллаху алейхи вассалам",
"♛ ｅ ｍ ｏ ｄ ｒ ａ ｉ ｎ ｓ ♛",
"6eWeHыЙ_KaHrAJl",
"fipp трогал меня ТАМ.... Мне было 13 и я очень испугался 😢",
"fipp трогал меня ТАМ... мне было 12 и он меня катал на Nissaki Almera",
"𝓐𝓛𝓗𝓐𝓜𝓓𝓤𝓛𝓘𝓛𝓛𝓐𝓗 𝓘𝓝𝓢𝓗𝓐𝓛𝓛𝓐𝓗",
"Тот самый бот, который раздевает девочек - vk.com/try2hard",
"школьный повор педофил (◣◢)",
"сегодня выпил бутылочку ягуара и ♥♥♥♥♥♥♥♥♥♥♥♥ ♥♥♥♥♥♥♥♥♥♥асов ёпраесете",
"♚ ＴＯＲＥＴＴＯＧＡＮＧ ♚ ",
"𝕠𝕨𝕟𝕖𝕕 𝕓𝕪 𝕣𝕦𝕤𝕤𝕚𝕒𝕟 𝕜𝕚𝕟𝕘𝕤 $",
"SANCHEZj,SHIBA,RIGZ vs storry,Razen,kitty,wavvy godless stack owned",
"ｒｉｃｈ ｍｙ ｍａｉｎ", 
"𝒍𝒂𝒎𝒃𝒐𝒓𝒈𝒊𝒈𝒏𝒊 𝒐𝒘𝒏𝒆𝒓", 
"𝕕𝕠 𝕪𝕠𝕦 𝕙𝕒𝕧𝕖 𝕙𝕒𝕝𝕗 𝕒𝕟𝕘𝕣𝕪 𝕔𝕠𝕟𝕗𝕚𝕘 𝕗𝕠𝕣 𝕘𝕒𝕞𝕖𝕤𝕖𝕟𝕤𝕖?", 
"𝙗𝙞𝙜 𝙣𝙖𝙢𝙚𝙧, 𝙞𝙢 𝙩𝙝𝙞𝙣𝙠 𝙮𝙤𝙪 𝙙𝙧𝙤𝙥 𝙮𝙤𝙪𝙧 𝙘𝙧𝙤𝙬𝙣 𝙨𝙤 𝙞𝙢 𝙬𝙚𝙣𝙩 𝙥𝙞𝙩𝙘𝙝𝙙𝙤𝙬𝙣 𝙞𝙣 𝙢𝙢 𝙖𝙣𝙙 𝙥𝙞𝙘𝙠𝙚𝙙 𝙞𝙩 𝙪𝙥, 𝙝𝙚𝙧𝙚 𝙮𝙤𝙪 𝙜𝙤 𝙠𝙞𝙣𝙜 ♛","𝕚𝕕𝕚𝕠𝕥 𝕒𝕝𝕨𝕒𝕪𝕤 𝕒𝕤𝕜 𝕞𝕖, 𝕦𝕚𝕕? 𝕒𝕟𝕕 𝕚𝕞 𝕕𝕠𝕟𝕥 𝕒𝕟𝕤𝕨𝕖𝕣, 𝕚 𝕝𝕖𝕥 𝕥𝕙𝕖 𝕤𝕔𝕠𝕣𝕖𝕓𝕠𝕒𝕣𝕕 𝕥𝕒𝕝𝕜♛ (◣◢)","пастирал тебя хуем", "с4астлива сосешь мне", "  CFG by KuCJloTa  ", "Создатель LUA angelwings", "C͜͡n͜͡u͜͡ H͜͡a͜͡x͜͡y͜͡u͜͡", "с⃞п⃞и⃞ ш⃞л⃞ю⃞х⃞а⃞",
"✧:･ﾟ✧ 𝐅𝐔𝐂𝐊 𝐘𝐎𝐔 ✧:･ﾟ✧","манипулирую хуем над табой", "хуем па ребрам тебе", "4ота сасируеш потна", "1 спи долбаеб", "в ебыч хуйсос", "на хуе ща крутишься у мя)", "⛓𝐁𝐋𝐔𝐇𝐆𝐀𝐍𝐆 🖤 𝐕𝐒 𝐠𝐨𝐝𝐥𝐞𝐬𝐬 [𝟓𝐯𝟏𝟗] After this game they no longer believe in God rayzen,onej,vitma owned", "ебучий рекс ты сын шлюхи завали ебало",
"хахах просто легкий пидорас", "☂️Vac Enjoyer (HVH)☂️", "allah headshot", "angelwings Loading… █▒▒▒▒▒▒▒▒▒ 10% ███▒▒▒▒▒▒▒ 30% █████▒▒▒▒▒ 50% ███████▒▒▒ 100%", "на завод иди", "| Welcome to angelwings |", "▄ ▀▄ ▀▄ ▀▄ НА ТАКСИ ТЕБЯ СБИЛ ЕПТА ХАХА", "€6@L TBO|-O ᛖ@Ťѣ √ թΘТ", "▀▄▀▄▀▄▀▄▀▄▀▄", "пончик ебаный я твоей маме колени выбил битой", "глотни коки яки хуйсоска", "спи хуйсоска)", "спи нахуй пидораска", "АХХАХА МАТЬ ЕБАЛ ТВОЮ СЫН ШЛЮХИ", "ахуеnnø мамашу tvøю øbжøpиstyю ебал es ez хихи =D", "sasesh мøй хуй kpуta es ez =D", "old SANCHEZj is back but i never left [1v1] onej ПУСТЬ УМРУТ ТВОИ РОДИТЕЛИ... † OWNED MY DOG", "+rep 🅻 🅴 🅶 🅸 🆃 💥", "ALLAH DİYEN ŞOK POŞETİ | KEYDROP", "ты че пидорас в светлое будущее попрыгал что-ли?", "ХАХАХА ЧЕ ТЫ ТАМ ВРЕДИТЕЛЬ АХАХАХ СПОТИФАЙ ХАХА Х", "СПОТЛАЙТ СПОТЛАЙТ АХАХА СПИНОЙ ПИДОРАСА УБИВАЮ ХАХА", "АХХАХА ПИДОРАС ТЫ ЧЕ ТУПОЙ ТО ТАКОЙ", "пraдaлzхaйу пинaт' тvaййу мaмasху хихи es ez =D", "най чит чел..", "с хуйом маим работайш)", "SANCHEZj [1v1] ptemt Проиграл МАТЬ на 1x1, возможно навсегда. st1vaha,rayzen,vitma Owned..", "This dogs dont have chance against angelwings",
"спи нахуй пидорас ебанный куда пошёл сын шлюхи", "♛ Ｔａｄｚｈ３３ｋ ♛", "SANCHEZJ $ PTEMT BLUHGANG TEAM", "Ｌｉｎｋ ｍａｉｎ ｂｅｆｏｒｅ ｓｐｅａｋｉｎｇ ♛",": Your name - missed shot due to resolver.", "изи", "ммовский хуесос ты для чего на паблик зашел, заблудился чтоли?", "спи нахуй пидораска)", "▼- стрелочка вниз","-𝚛𝚎𝚙 0 𝚒𝚚", "$ angelwings $ LUA", "๑۩۞۩๑√ОТЛЕТАЙ НУБЯРА√๑۩۞۩๑", "ЗНẪЙ СВОЁ ḾḜḈТО НИЧТОЖḜСТВØ", "†ПоКоЙсЯ(ٿ)с(ٿ)Миром†", "я играю с конфигом от pytbylev (◣_◢)",
"₽вȁл гȫρтăнь Ŧвȫей ʍа₮еᎵน", "Аллах бабах чурки", "АХМАТ СИЛА Алла́ху А́кбар ЛЕТИ", "[̲̅Д̲̅о̲̅П̲̅р̲̅ы̲̅Г̲̅а̲̲л̲̅с̲̅я̲̅(ت)̲̅Д̲̅р̲̅У̲̅ж̲̅о̲̅Ч̲̅е̲̅К̲̅]", "я ᴇбᴀᴧ ᴛʙᴏю ʍᴀᴛь [◣_◢]", "𝐢 𝐬𝐦𝐨𝐤𝐞 𝐜𝐡𝐚𝐫𝐨𝐧 𝐚𝐧𝐝 𝐝𝐫𝐢𝐧𝐤 𝐜𝐨𝐥𝐚 𝐝𝐨𝐛𝐫𝐢𝐲", "—Если братишка рядом —То враги падают градом 🧢Z", "отсосал как 𝕥𝕖𝕕𝕪","ℳАℳКУ ЕБАЛ","𝙸<𝟹 𝙾𝙿𝙴𝚁𝙿𝙻𝚄𝙶 ☆","𝐟𝐮𝐤 𝟏𝟎𝟐","-𝒓𝒆𝒑 𝒄𝒉𝒆𝒂𝒕𝒔","CАСЁШ КАК 𝕆ℝ𝔻","𝕏עӥ☾𝕠⊂","Я бы после такого в игру не заходил *fipp,albenix,sheefu,borya,vitma,st1vaha,d4ssh*","AWpKINGNeededSmoke $ 𝐓𝐡𝐞𝐲 𝐰𝐚𝐧𝐭 𝐭𝐨 𝐛𝐞 𝐥𝐢𝐤𝐞 𝐦𝐞 𝐛𝐮𝐭 𝐈 𝐛𝐞𝐥𝐨𝐧𝐠 𝐭𝐨 𝐚 𝐟𝐚𝐦𝐢𝐥𝐲 𝐨𝐟 𝐊𝐈𝐍𝐆𝐒","⋆н⋆а⋆ ⋆к⋆о⋆л⋆е⋆н⋆и⋆","😱 В Башкирии женщина год спала с любовником и заразилась от него ВИЧ","vk.com/tryhard <-— лʏчωии свᴀдᴇҕныи фотоrᴘᴀф","vk.com/VAMPIRE <-— лʏчωии свᴀдᴇҕныи фотоrᴘᴀф","ᙐᗣᏦᑌᕼᎽᙁ ᙅᕼᚿθᙅᑌᏦᗣ","匚ㄖᗪ乇10 卂ㄥ山卂ㄚ丂 ㄖ几","я иrᴘᴀю с 𝔸𝔸ℝℕ𝔼.ℂ𝕃𝕌𝔹, ҕᴇrитᴇ","𝐬𝐥𝐨𝐰𝐞𝐝 + 𝐫𝐞𝐯𝐞𝐫𝐛","₴ⱠØ₩ɆĐ + ⱤɆVɆⱤ฿","丂ㄥㄖ山乇ᗪ + 尺乇ᐯ乇尺乃","(っ◔◡◔)っ ♥ slowed + reverb ♥","˜”°•.˜”°• slowed + reverb •°”˜.•°”˜","ｓｌｏｗｅｄ ＋ ｒｅｖｅｒｂ","”°•.˜vk.com/vampire”°•","♥vk.com/vampire♥","𝕧𝕜.𝕔𝕠𝕞/𝕧𝕒𝕞𝕡𝕚𝕣𝕖","ｖｋ．ｃｏｍ／ｖａｍｐｉｒｅ","ᴠᴋ.ᴄᴏᴍ/ᴠᴀᴍᴘɪʀᴇ","𝚟𝚔.𝚌𝚘𝚖/𝚟𝚊𝚖𝚙𝚒𝚛𝚎","ｖｋ．ｃｏｍ／ｖａｍｐｉｒｅ　リゃド","【﻿ｖｋ．ｃｏｍ／ｖａｍｐｉｒｅ】","▀▄▀▄▀▄   🎀  𝓋𝓀.𝒸☯𝓂/𝓋𝒶𝓂𝓅𝒾𝓇𝑒  🎀   ▄▀▄▀▄▀","𝕒𝕝𝕝 𝕗𝕒𝕞𝕚𝕝𝕪 𝕨𝕚𝕥𝕙 𝕦𝕤𝕖𝕣𝕟𝕒𝕞𝕖𝕤","ａｌｌ ｆａｍｉｌｙ ｗｉｔｈ ｕｓｅｒｎａｍｅｓ","FNAAAAAY В ЧАААТ (◣_◢),"
}

local deathsay_sentences = {
   "Ты как убил меня?", "?", "да каааааак", "БЛЯ КАК", "cerf t,fyfz", "ну везет же", "найс везет хуесос", "ХАХАХАХА ДАУН КАК ТЫ УБИВАЕШЬ МЕНЯ В ЛОУДЕЛЬТУ", "пидор дырявый", 
	"залупой зубы бы тебе выбил гандон", "ПИДОАРС БЛЯЯЯЯ", "ахах чел ты меня убиваешь онли по ногам и то когда я лоу хп", "LUCKBOOST.CFG <-- UR CFG RN ", "да почему за меня вечно дегенераты",
	"ASDJASDHUIASOGHDAIHaIHSDIOADHAIDHASDIHIuh--[oDAHSDOIasD", "ты такой конченый блять", "cerf", "нахера ты летишь на меня тупой фывфыгвпфнвфнгвпфыгнвпфыгшнвпфнгв", 
	"у меня же десинк 40 градусов каааааак", "как ты своим вейви мой скит убил", "тупой хуесос без скита", "почему тебе можно просто лететь на меня и делать хуйню а мне нельззщя",
	"ААААААААААААААААААААААААААААААААААААААААА", "что ты делаешь даун", "миндамаг не выбил", "найс с дамагом хуесос", "даблтап забыл отжать бля", "КАК В ХАЙДШОТСЫ СУКА", 
	"ну зачем с фейклагами то", "глянь что долбаёб с никсваром делает", "блять как этим автопиком пользоваться", "Я СКОРО КОМП НАХУЙ СЛОМАЮ СУКА", "мышка лагает пиздец", "клавиша отпала", "да как с этим говном играть", "что за чит у тебя?", 
	"ljk,ft, t,fysq cerf", "сука пробел залип", "[gamesense] miss to resolver", "[gamesense] miss to spread", "[gamesens e] missed to resolver", "cerf ghj,tk pfkbg", "блять у меня ошибка вылезла", "что за хуйня у меня просто монитор погас", "СУКА Я ЧАЙ ПРОЛИЛ НА КЛАВУ"
}

local function on_player_death(event)
    if ui.get(killsay_enabled) then
        local local_player = entity.get_local_player()
        local attacker = client.userid_to_entindex(event.attacker)
        local victim = client.userid_to_entindex(event.userid)

        if local_player == nil or attacker == nil or victim == nil then
            return
        end

        if attacker == local_player and victim ~= local_player then
            local killsay = "say " .. killsay_sentences[math.random(#killsay_sentences)]

            if ui.get(killsayName_enabled) then
                killsay = string.gsub(killsay, "$name", entity.get_player_name(victim))
            else
                killsay = string.gsub(killsay, "$name,", " ")
            end

            client.log(killsay)
            client.exec(killsay)
        end
    end

    if ui.get(deathsay_enabled) then
        local local_player = entity.get_local_player()
        local victim = client.userid_to_entindex(event.userid)

        if local_player == nil or victim == nil then
            return
        end

        if victim == local_player then
            local deathsay = "say " .. deathsay_sentences[math.random(#deathsay_sentences)]

            if ui.get(killsayName_enabled) then
                deathsay = string.gsub(deathsay, "$name", entity.get_player_name(attacker))
            else
                deathsay = string.gsub(deathsay, "$name,", " ")
            end

            client.log(deathsay)
            client.exec(deathsay)
        end
    end
end

math.randomseed(133742069)
math.random(); math.random(); math.random()

client.set_event_callback("player_death", on_player_death)